// produce by `code --list-extensions >> vs_code_extensions_list.txt`
aaron-bond.better-comments
aeschli.vscode-css-formatter
asciidoctor.asciidoctor-vscode
cheshirekow.cmake-format
chris-noring.node-snippets
chrmarti.regex
daohong-emilio.yash
darkriszty.markdown-table-prettify
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
ecmel.vscode-html-css
editorconfig.editorconfig
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
hanifmifta.adocs
henriiik.docker-linter
holmescn.vscode-wordcount-cjk
jakob101.relativepath
james-yu.latex-workshop
joaompinto.vscode-graphviz
k--kato.intellij-idea-keybindings
kisstkondoros.vscode-codemetrics
luniclynx.bison
mhutchie.git-graph
michelemelluso.gitignore
mrmlnc.vscode-less
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.powershell
njpwerner.autodocstring
piotrpalarz.vscode-gitignore-generator
redhat.vscode-xml
remisa.shellman
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
tecosaur.latex-utilities
timonwong.shellcheck
twxs.cmake
vscode-icons-team.vscode-icons
vue.volar
// use by `get-content c:\exportedlist.txt | % { code --install-extension $_ }` on Windows
// or `cat ./vs_code_extensions_list.txt | xargs -L1 code --install-extension` in unix-like
